use adkar;

-- CREATE TABLE MorningAzkar (
--     id INT AUTO_INCREMENT PRIMARY KEY,
--     category VARCHAR(255),
--     count INT,
--     description VARCHAR(255),
--     reference VARCHAR(255),
--     content TEXT
-- );

-- -- Insert the data
-- INSERT INTO MorningAzkar (category, count, description, reference, content)
-- VALUES
-- ('أذكار الصباح', 1, '', '', 'أَصْـبَحْنا وَأَصْـبَحَ المُـلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير'),
-- ('أذكار الصباح', 1, 'من قالها موقنا بها حين يمسى ومات من ليلته دخل الجنة وكذلك حين يصبح.', '', 'اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ ، خَلَقْتَنـي وَأَنا عَبْـدُك ، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت ، أَعـوذُبِكَ مِنْ شَـرِّ ما صَنَـعْت ، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ .'),
-- ('أذكار الصباح', 3, 'من قالها حين يصبح وحين يمسى كان حقا على الله أن يرضيه يوم القيامة.', '', 'رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلى الله عليه وسلم نَبِيّـاً. '),
-- ('أذكار الصباح', 4, 'من قالها أعتقه الله من النار.', '', 'اللّهُـمَّـ إِنِّـي أَصْبَـحْتُ أُشْـهِدُك ، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك ، وَمَلَائِكَتَكَ ، وَجَمـيعَ خَلْـقِك ، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك ، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك.'),
-- ('أذكار الصباح', 7, 'من قالها كفاه الله ما أهمه من أمر الدنيا والأخرة.', '', 'حَسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم.'),
-- ('أذكار الصباح', 3, '', '', 'بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم.'),
-- ('أذكار الصباح', 1, '', '', 'اللّهُـمَّ بِكَ أَصْـبَحْنا وَبِكَ أَمْسَـينا ، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ النُّـشُور.'),
-- ('أذكار الصباح', 1, '', '', 'أَصْبَـحْنا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ الْمُشْرِكِينَ.'),
-- ('أذكار الصباح', 3, '', '', 'سُبْحـانَ اللهِ وَبِحَمْـدِهِ عَدَدَ خَلْـقِه ، وَرِضـا نَفْسِـه ، وَزِنَـةَ عَـرْشِـه ، وَمِـدادَ كَلِمـاتِـه.'),
-- ('أذكار الصباح', 3, '', '', 'اللّهُـمَّ عافِـني في بَدَنـي ، اللّهُـمَّ عافِـني في سَمْـعي ، اللّهُـمَّ عافِـني في بَصَـري ، لا إلهَ إلاّ أَنْـتَ.'),
-- ('أذكار الصباح', 3, '', '', 'اللّهُـمَّ إِنّـي أَعـوذُ بِكَ مِنَ الْكُـفر ، وَالفَـقْر ، وَأَعـوذُ بِكَ مِـنْ عَذابِ القَـبْر ، لا إلهَ إلاّ أَنْـتَ.'),
-- ('أذكار الصباح', 1, '', '', 'اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في الدُّنْـيا وَالآخِـرَة ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني وَدُنْـيايَ وَأهْـلي وَمالـي ، اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي ، اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْـفـي وَعَن يَمـيني وَعَن شِمـالي ، وَمِن فَوْقـي ، وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْـتـي.'),
-- ('أذكار الصباح', 3, '', '', 'يَا حَيُّ يَا قيُّومُ بِرَحْمَتِكَ أسْتَغِيثُ أصْلِحْ لِي شَأْنِي كُلَّهُ وَلاَ تَكِلْنِي إلَى نَفْسِي طَرْفَةَ عَيْنٍ.'),
-- ('أذكار الصباح', 1, '', '', 'أَصْبَـحْنا وَأَصْبَـحْ المُـلْكُ للهِ رَبِّ العـالَمـين ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ خَـيْرَ هـذا الـيَوْم ، فَـتْحَهُ ، وَنَصْـرَهُ ، وَنـورَهُ وَبَـرَكَتَـهُ ، وَهُـداهُ ، وَأَعـوذُ بِـكَ مِـنْ شَـرِّ ما فـيهِ وَشَـرِّ ما بَعْـدَه.'),
-- ('أذكار الصباح', 1, '', '', 'اللّهُـمَّ ما أَصْبَـحَ بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك ، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـكَ ، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر.');



-- SELECT * FROM MorningAzkar;

-- CREATE TABLE adhkar_after_prayer (
--     id INT AUTO_INCREMENT PRIMARY KEY,
--     category VARCHAR(255),
--     count VARCHAR(10),
--     description VARCHAR(255),
--     reference VARCHAR(255),
--     content TEXT
-- );

-- INSERT INTO adhkar_after_prayer (category, count, description, reference, content) VALUES
-- ('أذكار بعد السلام من الصلاة المفروضة', '01', '', '', 'أَسْـتَغْفِرُ الله، أَسْـتَغْفِرُ الله، أَسْـتَغْفِرُ الله.اللّهُـمَّ أَنْـتَ السَّلامُ ، وَمِـنْكَ السَّلام ، تَبارَكْتَ يا ذا الجَـلالِ وَالإِكْـرام .'),
-- ('أذكار بعد السلام من الصلاة المفروضة', '01', '', '', 'لا إلهَ إلاّ اللّهُ وحدَهُ لا شريكَ لهُ، لهُ المُـلْكُ ولهُ الحَمْد، وهوَ على كلّ شَيءٍ قَدير، اللّهُـمَّ لا مانِعَ لِما أَعْطَـيْت، وَلا مُعْطِـيَ لِما مَنَـعْت، وَلا يَنْفَـعُ ذا الجَـدِّ مِنْـكَ الجَـد.'),
-- ('أذكار بعد السلام من الصلاة المفروضة', '01', '', '', 'لا إلهَ إلاّ اللّه, وحدَهُ لا شريكَ لهُ، لهُ الملكُ ولهُ الحَمْد، وهوَ على كلّ شيءٍ قدير، لا حَـوْلَ وَلا قـوَّةَ إِلاّ بِاللهِ، لا إلهَ إلاّ اللّـه، وَلا نَعْـبُـدُ إِلاّ إيّـاه, لَهُ النِّعْـمَةُ وَلَهُ الفَضْل وَلَهُ الثَّـناءُ الحَـسَن، لا إلهَ إلاّ اللّهُ مخْلِصـينَ لَـهُ الدِّينَ وَلَوْ كَـرِهَ الكـافِرون.'),
-- ('أذكار بعد السلام من الصلاة المفروضة', '33', '', '', 'سُـبْحانَ اللهِ، والحَمْـدُ لله ، واللهُ أكْـبَر.'),
-- ('أذكار بعد السلام من الصلاة المفروضة', '01', '', '', 'لا إلهَ إلاّ اللّهُ وَحْـدَهُ لا شريكَ لهُ، لهُ الملكُ ولهُ الحَمْد، وهُوَ على كُلّ شَيءٍ قَـدير.'),
-- ('أذكار بعد السلام من الصلاة المفروضة', '10', 'عَشْر مَرّات بَعْدَ المَغْرِب وَالصّـبْح.', '', 'لا إلهَ إلاّ اللّهُ وحْـدَهُ لا شريكَ لهُ، لهُ المُلكُ ولهُ الحَمْد، يُحيـي وَيُمـيتُ وهُوَ على كُلّ شيءٍ قدير.'),
-- ('أذكار بعد السلام من الصلاة المفروضة', '01', 'بَعْد السّلامِ من صَلاةِ الفَجْر.', '', 'اللّهُـمَّ إِنِّـي أَسْأَلُـكَ عِلْمـاً نافِعـاً وَرِزْقـاً طَيِّـباً ، وَعَمَـلاً مُتَقَـبَّلاً.'),
-- ('أذكار بعد السلام من الصلاة المفروضة', '07', 'بعد صلاة الصبح والمغرب.', '', 'اللَّهُمَّ أَجِرْنِي مِنْ النَّار.'),
-- ('أذكار بعد السلام من الصلاة المفروضة', '01', '', '', 'اللَّهُمَّ أَعِنِّي عَلَى ذِكْرِكَ وَشُكْرِكَ وَحُسْنِ عِبَادَتِكَ.');

